In [1]:
import numpy as np
import pandas as pd
import matplotlib

In [7]:
# Series

list1 = [4,3,6,8,7]
s1 = pd.Series(list1)
# s1 = pd.Series(list1, index =['a','b','c','d','e'])
print('s1 : \n', s1)
type(s1)
s1.dtype
s1.values
s1.index=['a','b','c','d','e']
# s1.index

s1 :
 0    4
1    3
2    6
3    8
4    7
dtype: int64

In [8]:
sdata={'kim' : 80, 'lee':85, 'choi':85}
s2 = pd.Series(sdata)
s2

kim     80
lee     85
choi    85
dtype: int64

In [11]:
# DataFrame

# DataFrame : 생성
# 형식: pd.DataFrame(data, columns=[], index=[])

# dictionary 데이터 활용
data = {'names':['민준', '현우', '서연', '동현', '지현'],
        'years':[2013, 2014, 2015, 2016, 2015],
        'points':[1.5, 1.7, 3.6, 2.4, 2.9]
        }
df = pd.DataFrame(data)

# print(df)와 df 출력방식이 서로 다름
print(df)
df

  names  years  points
0    민준   2013     1.5
1    현우   2014     1.7
2    서연   2015     3.6
3    동현   2016     2.4
4    지현   2015     2.9

  names  years  points
0    민준   2013     1.5
1    현우   2014     1.7
2    서연   2015     3.6
3    동현   2016     2.4
4    지현   2015     2.9

In [13]:
names=['민준', '현우', '서연', '동현', '지현']
years=[2013, 2014, 2015, 2016, 2015]
points=[1.5, 1.7, 3.6, 2.4, 2.9]
data1 = [names, years, points]
data1
# -> 데이터가 3행 5열로 나옴 -> T(transpose)를 사용하여 행/열 반전시킴

[['민준', '현우', '서연', '동현', '지현'],
 [2013, 2014, 2015, 2016, 2015],
 [1.5, 1.7, 3.6, 2.4, 2.9]]

In [17]:
# 2차원 배열 데이터 활용
data2 = [['민준', '현우', '서연', '동현', '지현'],
         [2013, 2014, 2015, 2016, 2015],
         [1.5, 1.7, 3.6, 2.4, 2.9]]
arr = np.array(data2).T
df1 = pd.DataFrame(arr)
df1.columns=['name', 'year', 'point']
df1.index=[1,2,3,4,5]
# df1 = pd.DataFrame(arr, columns=['name', 'year', 'point'], index=[1,2,3,4,5])
df1

  name  year point
1   민준  2013   1.5
2   현우  2014   1.7
3   서연  2015   3.6
4   동현  2016   2.4
5   지현  2015   2.9

In [24]:
print(df1)
print(df1.index)
print(df.index)
print(df1.values)
print(df1.columns)

  name  year point
1   민준  2013   1.5
2   현우  2014   1.7
3   서연  2015   3.6
4   동현  2016   2.4
5   지현  2015   2.9
Index([1, 2, 3, 4, 5], dtype='int64')
RangeIndex(start=0, stop=5, step=1)
[['민준' '2013' '1.5']
 ['현우' '2014' '1.7']
 ['서연' '2015' '3.6']
 ['동현' '2016' '2.4']
 ['지현' '2015' '2.9']]
Index(['name', 'year', 'point'], dtype='object')

In [27]:
df1.info()
# array로 만든 후 dataframe을 만들었기 때문에 dtype이 전부  object로 나옴
# array는 한가지 데이터 타입만 들어갈 수 있다

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, 1 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   year    5 non-null      object
 2   point   5 non-null      object
dtypes: object(3)
memory usage: 160.0+ bytes

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   names   5 non-null      object
 1   years   5 non-null      int64
 2   points  5 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 252.0+ bytes